function [p,r]=circle_r(p1,p2,p3)
%求解空间中三个不共线三点的p1,p2,p3的圆，
%输出为圆心三维坐标p和半径r
if (norm(p2-p1)+norm(p3-p1))<10^-6
    p=p1;
    r=0;
    return
elseif abs(cross((p2-p1),(p3-p2)))<10^-6
    error('输入的三点在同一直线上')
end
p1=p1(:);
p2=p2(:);
p3=p3(:);
%根据平面方程Ax+By+Cz+D=0可以进行列方程得到
A1=det([p1(2) p1(3) 1;
        p2(2) p2(3) 1;
        p3(2) p3(3) 1]);
B1=-det([p1(1) p1(3) 1;
         p2(1) p2(3) 1;
         p3(1) p3(3) 1]);
C1=det([p1(1) p1(2) 1;
         p2(1) p2(2) 1;
         p3(1) p3(2) 1]); 
D1=-det([p1 p2 p3]');

A2=2*(p2(1)-p1(1));
B2=2*(p2(2)-p1(2));
C2=2*(p2(3)-p1(3));
D2=p1(1)^2+p1(2)^2+p1(3)^2-p2(1)^2-p2(2)^2-p2(3)^2;

A3=2*(p3(1)-p1(1));
B3=2*(p3(2)-p1(2));
C3=2*(p3(3)-p1(3));
D3=p1(1)^2+p1(2)^2+p1(3)^2-p3(1)^2-p3(2)^2-p3(3)^2;
coeff=[A1 B1 C1;
       A2 B2 C2;
       A3 B3 C3];
p=-inv(coeff)*[D1 D2 D3]';
r=norm(p-p1);
end